# BuiltInFailures.SectionViewFailures Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuiltInFailures..::..SectionViewFailures Properties
BuiltInFailures..::..SectionViewFailures Class See Also
---
The BuiltInFailures..::..SectionViewFailures type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ScopeBoxBehindSection | Section may not be associated to a scope box which lies behind it. |

# See Also
BuiltInFailures..::..SectionViewFailures Class
Autodesk.Revit.DB Namespace